Classes | Public Member Functions | Static Public Member Functions | Friends | List of all members
ACAPI::MEP::SystemGroup Class Referencefinal
MEP Element Manager
A SystemGroup represents a collection of PhysicalSystems. More...
#include <MEPSystemGroup.hpp>
 Inheritance diagram for ACAPI::MEP::SystemGroup:
 Classes
class  | Modifier
Modifier object for SystemGroup. More...
 Public Member Functions
Result< void >  | IsEditable () const
Checks whether the SystemGroup is editable.
GS::UniString  | GetName () const
Gets the name of the SystemGroup.
std::vector< UniqueID >  | GetSystemIDs () const
Gets the IDs of the PhysicalSystems currently contained in the SystemGroup.
template<std::invocable< SystemGroup::Modifier & > ModifierFunc>
Result< void >  | Modify (ModifierFunc &&modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< SystemGroup >  | Get (const UniqueID &uniqueId)
Returns the SystemGroup.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< std::vector< UniqueID > >  | GetSystemGroupIDs ()
Fetches the IDs of the current SystemGroups.
Result< SystemGroup >  | CreateSystemGroup (const GS::UniString &name, const GS::UniString &undoString="Create system group")
Creates a new SystemGroup.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A SystemGroup represents a collection of PhysicalSystems.
The SystemGroup has its own name and can be used by a user in the system browser to categorize sets of PhysicalSystems. The PhysicalSystems contained in the SystemGroup does not need to share a common connection (e.g. domain).
See also
PhysicalSystem
Since
Archicad 29
Member Function Documentation
◆ Get()
 static Result< SystemGroup > ACAPI::MEP::SystemGroup::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns the SystemGroup.
Parameters
uniqueId | The unique identifier of the SystemGroup object
Returns
If the uniqueId refers to a SystemGroup, returns the associated object, otherwise an error.
 const ACAPI::Result<ACAPI::MEP::SystemGroup> systemGroup { ACAPI::MEP::SystemGroup::Get (systemGroupID) };
 if (systemGroup.IsErr ())
 return systemGroup.UnwrapErr ().kind;
◆ GetName()
 GS::UniString ACAPI::MEP::SystemGroup::GetName  |  ( |   | ) |   const
Gets the name of the SystemGroup.
Returns
The name of the SystemGroup
// ! [PhysicalSystem-GetName-Example]
 GS::UniString labelContent { GS::UniString::SPrintf ("Group: %T, System: %T", systemGroup->GetName (), system->GetName ()) };
 const GS::GSErrCode err { CreateLabelOnElement (element.Unwrap (), std::move (labelContent)) };
 if (err != NoError)
 return err;
◆ GetSystemIDs()
 std::vector< UniqueID > ACAPI::MEP::SystemGroup::GetSystemIDs  |  ( |   | ) |   const
Gets the IDs of the PhysicalSystems currently contained in the SystemGroup.
Returns
The IDs of the PhysicalSystems currently contained in the SystemGroup
 const std::vector<ACAPI::MEP::UniqueID> systemIDs = systemGroup.Unwrap ().GetSystemIDs ();
 for (const ACAPI::MEP::UniqueID& systemID : systemIDs) {
◆ IsEditable()
 Result< void > ACAPI::MEP::SystemGroup::IsEditable  |  ( |   | ) |   const
Checks whether the SystemGroup is editable.
Returns
Returns nothing if the SystemGroup is editable, otherwise the error containing information about the reason.
◆ Modify()
 template<std::invocable< SystemGroup::Modifier & > ModifierFunc>
 Result< void > ACAPI::MEP::SystemGroup::Modify  |  ( |  ModifierFunc && |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function, function pointer or similar) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
// ! [SystemGroup-Modifier-Add-Example]
 std::optional<ACAPI::MEP::UniqueID> createdId;
 if (group.Modify ([&](ACAPI::MEP::SystemGroup::Modifier& modifier) -> GS::GSErrCode {
 const auto result { modifier.Add (suggestedName) };
 if (result.IsErr ())
 return result.UnwrapErr ().kind;
 createdId = result.Unwrap ();
 return NoError;
 }, "Create new system.").IsErr ())
 return {};
// ! [SystemGroup-Modifier-Add-Example]
Friends And Related Symbol Documentation
◆ CreateSystemGroup
 Result< SystemGroup > CreateSystemGroup  |  ( |  const GS::UniString & |  name,
|  const GS::UniString & |  undoString = "Create system group" )
friend
Creates a new SystemGroup.
Parameters
name | The name of the new SystemGroup.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
A new SystemGroup if successful, otherwise an error.
constexpr std::string_view DefaultSystemGroupName { "Generated System Group" };
std::optional<ACAPI::MEP::SystemGroup> FindOrCreateDefaultGroup ()
{
 // First, locate the default system group:
 auto systemGroups { ACAPI::MEP::GetSystemGroupIDs () };
 if (systemGroups.IsErr ())
 return {};
 for (const auto& id : systemGroups.Unwrap ()) {
 auto systemGroup { ACAPI::MEP::SystemGroup::Get (id) };
 if (systemGroup.IsErr ())
 return {};
 if (systemGroup->GetName () == DefaultSystemGroupName)
 return systemGroup.Unwrap ();
 }
 auto newlyCreatedSystemGroup { ACAPI::MEP::CreateSystemGroup (GS::UniString { DefaultSystemGroupName }) };
 if (newlyCreatedSystemGroup.IsErr ())
 return {};
 return newlyCreatedSystemGroup.Unwrap ();
}
◆ GetSystemGroupIDs
 Result< std::vector< UniqueID > > GetSystemGroupIDs  |  ( |   | )
friend
Fetches the IDs of the current SystemGroups.
Returns
A list of the IDs of the current SystemGroups.
 const ACAPI::Result<std::vector<ACAPI::MEP::UniqueID>> systemGroupIDs { ACAPI::MEP::GetSystemGroupIDs () };
 if (systemGroupIDs.IsErr ())
 return systemGroupIDs.UnwrapErr ().kind;
 for (const ACAPI::MEP::UniqueID& systemGroupID : systemGroupIDs.Unwrap ()) {